app/controllers/api/channels_controller.rb

SELECT "channels".* FROM "channels" WHERE "channels"."server_id" = $1  [["server_id", 16]]
SELECT  "servers".* FROM "servers" WHERE "servers"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
    def index
        @channels = Server.find(params[:server_id]).channels

SELECT  "servers".* FROM "servers" WHERE "servers"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
    def show
        @channel = Server.find(params[:server_id]).channels