app/controllers/api/servers_controller.rb

SELECT "servers".* FROM "servers"
---
    def index
        @servers = Server.all

INSERT INTO "servers" ("title", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Hey Alex"], ["author_id", 13], ["created_at", "2020-11-23 15:02:03.794121"], ["updated_at", "2020-11-23 15:02:03.794121"]]
---
    def create
        @server = current_user.servers.create(server_params)

SELECT  "servers".* FROM "servers" WHERE "servers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @server = Server.find(params[:id])

SELECT  "servers".* FROM "servers" WHERE "servers"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "servers" WHERE "servers"."id" = $1  [["id", 2]]
---
    def destroy
        @server = Server.find(params[:id])
        if @server.destroy