app/controllers/api/users_controller.rb

INSERT INTO "users" ("username", "email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "_zI7L6HSS_nJHniweJcZpsUTkgqHyFXpD4ZgTXqSoHg"], ["updated_at", "2020-11-18 16:19:56.302048"], ["id", 2]]
---
    def create
        debugger
        @user = User.create(user_params)
        if @user.save