app/channels/chat_channel.rb

  def speak(data)
    message = Message.new(body: data['message'], channel_id: data["channelId"], author_id: data["authorId"])
    if message.save!
---
INSERT INTO "messages" ("body", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["body", "What"], ["created_at", "2020-11-27 20:12:00.839889"], ["updated_at", "2020-11-27 20:12:00.839889"]]

  def load(data)
    puts data[:id]
    messages = Message.where(channel_id: data["id"])
    messageResponse = messages.map do |message|
---
SELECT "messages".* FROM "messages"